#for loop გამოყენებით გამოიტანეთ რიცხვები 1-დან 10-მდე
for i in range(1,10,1):
    print(i)

    print()

#2) დაწერეთ პროგრამა რომელიც ბეჭდავს 100 დან 200 მდე რიცხვებს
for i in range(100,200,1):
    print(i)

    print()

#3) დაბეჭდეთ 20-დან 50-მდე ყველა ლუწი რიცხვი
for i in range(20,50,2):
    print(i)

print()
#4) დაბეჭდეთ 1-დან 49-მდე ყველა კენტი რიცხვი

for i in range(1,49,3):
    print(i)

    print()

    #5) გამოიტანეთ 5-ის ჯერადი რიცხვები 100-დან 200-მდე
    for i in range(100,200,5):
        print(i)