# 4) მომხმარებელს შეაყვანინეთ რიცხვი და განაგრძეთ კითხვა მანამ, სანამ არ შეიტანს დადებით რიცხვს.

# num = int(input("enter a num: "))

# i = 1

# while i > 0:
#     if num > 0:
#         print(" ")
#         break
#     else: 
#         num = int(input("enter a num: "))


#  5) შექმენით სია რომელშიც გექნებათ ოცი სხვადასხვა რიცხვი შემდეგ კი დაბეჭდეთ მხოლოდ 20 ზე მეტი რიცხვები ისე რომ იყოს თან სამის ჯერადი გამოიყენეთ for loop

# num = [ 1, 23, 25, 53, 18, 42, 11, 8, 44, 12, 21, 63, 13, 99, 44, 45, 66, 23, 63, 27]

# for i in num:
#     if i > 20 and i %3 == 0:
#         print([i])

#  6) შექმენით სია სადაც მოათავსებთ ხუთ სხვადასხვა სახელს შემდეგ კი მიწვდით თითოეულ ელემენტს(სახელს) და დაბეჭდეთ თითოეულში ასოების რაოდენობა, გამოგადგებათ for loop და len ფუნქცია 

# names = ["tea", "lizi", "tako", "mari", "sasha", "sopia"]

# for i in range(len(names)):
#     print(names[i], "-", len(names[i]))

   

# 7) შექმენით სია სადაც მოათავსებთ ხუთ სხვადასხვა სახელს შემდეგ კი დაბეჭდეთ ამ სიაში თითოეული ელემენტის პირველი ასო მხოლოდ გამოიყენეთ for loop

# names = ["tea", "lizi", "tako", "mari", "sasha", "sopia"]
 
# for element in names:
#     print(element[0])