#ვაკეთებთ მაგალითებს and ოპერატორზე.and ოპერატორზე თუ გვინდა რომ true მივიღოთ ორივე მაგალითი
#უნდა იყოს true ,იგივეა false ოპერატორზეც
print(33 > 20 and 10 >5) #true 
print(25 >20 and 20 !=25) #true
print(20 ==20 and 25 <= 30)#true
print(25 != 20 and 40 > 30)#true
print(20 < 25 and 25 !=25) #false-რადგან  and ოპერატორზე ერთ ერთი მაინც თუ არის false ტერმინალში 
#ტერმინალში ვიღებთ false

#ვაკეთებთ მაგალითებს or ოპერატორზე.or ოპერატორზე ერთ ერთი მაგალითი თუ არის true 
#ტერმინალში ვიღებთ true
print(25 > 40 or 25 ==25) #true რადგან or ოპერატორზე ერთ ერთი მაგალითი არის true ამიტომ ტერმინალში
#მივიღებთ true
print(25 <= 30 or 40 !=40) #true
print(50 >= 20 or 50 !=20) #true
print(20 < 30 or 10 >20) #true
print(40 < 40 or 50 != 50) #false რადგან ორივე მაგალითი არის false