#ვიყენებთ > (მეტობის) ნიშანს და შედეგები გამოგვაქვს ტერმინალში
num1 = 10
num2 = 15
print(num1 > num2)
print(num2 > num1)
print(5 > 3)
print(12 > 15)
print(20 > 23)

#ვიყენებთ < (ნაკლებობის) ნიშანს და შედეგები გამოგვაქვს ტერმინალში
num1 = 20
num2 = 30
print(num2 < num1)
print(num1 < num2)
print(35 < 20)
print(12 < 10)
print(15 < 10)

#ვიყენებთ = (ტოლობის) ნიშანს და შედეგები გამოგვაქვს ტერმინალში
num1 = 20
num2 = 25
print(num1 == num2)
print(20 == 20)
print("goa" == "goa")
print("irakli" == "irakli")
print("GOA" == "goa") # ამ შემთხვევაში გამოიტანს false-რადგან დიდი ასოებით დაწერილი სახელი არ უდრის 
#პატარა ასოებით დაწერილს.

#ვიყენებთ <= (ნაკლებია ან ტოლია) ნიშანს და შედეგები გამოგვაქვს ტერმინალში
print(10 <= 10) #true
print(20 <= 25) #true რადგან ნაკლებია ან ტოლია ანუ 20 ნაკლებია 25-ზე
print(10 <= 20) #true
print(23 <= 25) #true
print(25 <= 10) #false

#ვიყენებთ >= (მეტია ან ტოლია) ნიშანს და შედეგები გამოგვაქვს ტერმინალში
print(20 >= 15) #true
print(15 >= 15) #true
print(30 >= 40) #false რადგან 30 არც მეტია და არც უდრის 40
print(10 >= 9) #true
print(20 >=20) #true

# ვიყენებთ != (არ უდრის) ნიშანს და შედეგები გამოგვაქვს ტერმინალში
num1 = 20
num2 = 25
print(num1 != num2) #true
print(20 != 20) #false 
print(25 != 20) #true
print("goa" != "GOA") #true
print(30 != 23) #true













